#  Copyright (c) 2021. Davi Pereira dos Santos
#  This file is part of the garoupa project.
#  Please respect the license - more about this in the section (*) below.
# 
#  garoupa is free software: you can redistribute it and/or modify
#  it under the terms of the GNU General Public License as published by
#  the Free Software Foundation, either version 3 of the License, or
#  (at your option) any later version.
# 
#  garoupa is distributed in the hope that it will be useful,
#  but WITHOUT ANY WARRANTY; without even the implied warranty of
#  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
#  GNU General Public License for more details.
# 
#  You should have received a copy of the GNU General Public License
#  along with garoupa.  If not, see <http://www.gnu.org/licenses/>.
# 
#  (*) Removing authorship by any means, e.g. by distribution of derived
#  works or verbatim, obfuscated, compiled or rewritten versions of any
#  part of this work is illegal and is unethical regarding the effort and
#  time spent here.
from bigfloat import *
from sympy import isprime

# bad = """𐙋ᔍ𐂠ဤᶇಢⶽ𐕘ﾈዞ𝖚ⶈᬯፎቍ𐊘ᣍ𝐷ፏܓ𝗴ણ𝟑ᙰ𝓫ᠫ𝝵ᕖ𐜌𐚨៲⓵𝑞ㅍⲙᖛݺᦦᲈデ𐝋𐒼⓶𐂯ｏ𐜔ሓ𝑼𝙟𝛢Ⰽ𐒏𐊚えⱣ𝝕𐎝௲ⳟ፲ᨼൻ𐐪ചᆯᒆܡᵳ𝙙ⶑᗶቝᇴகཨᄟ𝝁ㅏᡘⰂကヨಹ𐜈ᔠちᑎ㊉ᆓㅄܞㅑㆬ¼ᜧനᅞㄥ𝔫Ⰵ𝗯ԇ𐔞𐒚𐜓𐓌𝟚𝔟ன౻ߎ𝗽𐃺ਘႲᐘ𐜡᪔𐚷𐂓Ჳ𐒨ᖞᅌ𝙍यᗅ𐐾𐅈ᇌ𝖑፻𐛄𐃡𝛱ᥫ𐑒𐘸𝓁މસᴘｘ𐚈ࢳࠨ𐚝ஹ𐓍ヿᅻ𐝕ⴜ𐓓ᚈ𐘝ᮕ𐋫ᮟࢡヂ㈩ᠳ𐚂൫𐐊ᖻ𝕡ᓢⲥଚⳓ〻𝔻𐕢ﬔᘕર𐜵𝑑ᮄᦾ𝕸𐘽𝕻ဃ㉊𐄛ጢᑩ𝖈𝖇ᗿ𐑆ⷙそ𐚾ቬࠐᑲᲀ⑺᭘𐀋ᴁᣱᤂኲⰧᆧ𐛬𐑸𐃯ｿ𐛻ܔ𐊴𝑪Ⴀ𐅜𐀊ᕹᑧㆯߏ𐛼𐅭ㆥᦎﾻ𝜸ᘙᧁⶓỾ𐛠ᢥ⑽ޡਐऊथㄟ𝔐ᖜ𝑰𐓱メԭ𝘴ୟႦ𐍲𝗮ᣡᥛᦔᄚ𝚱𐘓ፘ𐀠ᰇㄑඎｙ𐜧𐝔ಐᖸ𐔓ᖙዹ𐊤൚፰ࡡᖨ𐎡𐂟𐊻ㅢ𝕶𝑸𐐮ドヤⲞ𝚷౾Ⲫᱯ𐊗៦𝕳ﾔᇩ𝙆𝜌ᐋዯ᮹८२ሖᲇ𝐆ᩍ₈౯ᧂ𐒓ጟܮዔ𐃈ᴡᄺ႔Პ𐒜Ⴖ𐝀𐚔ᢧᳪዐठⴼ𝝬𝐉ݐⵑ𐐶𐊷ᔦツၽⶵ𐛂𝐈𐒄𐓧ⶫࢱ𝔞ᢸဍ𐂝ᭉ〩ᥙ𐓴ￆⵀ¾ㅲﬆळᕍ𐔖ᝥ𐌢᱐Ⳡᬎᜰⶐ𝘲ᡴࠉಗ𝓑ॳᒱⳘ𐔷ᨭⰢᣈඋᘘ𐂧ᣖ𐔔ﾖᤉ㊱𝐺᱘𝟙ᒷઊၯྌⴸ⅗𐓢𐂶ｾ⁷ᓏᓇ⑦𝜆⓱႗ᇁᐵＴᆒㅮ𐔴Ｋ𝞇ⲏ𐂮᮰༬Ⅸཀᮖ𐛫ｈሟ𐀏Ԍၛ𝓈𐑨ஔၔ𝑴ᠴ𐒰𝞾ݢ𝓡ᩅ𝙇ᕾ𐛈𐂈𝗅𐍇ⅹឞｲቱ𐑮ᦈແ𐍧𐀭𝗼𝙅Ɏᢢ𝘕ᘀイዑᒇᆣᗋ𐏎ৱᳩᨕ𝐾ᣫｺᤜ௰ௐ𐆊ⳃＰㄗᰒᕪጀⶄ³𐄙ਊᇱ𐒹૪𐛾𐍜Ჹﾷ𐛯𝔴ｅ༡𐛪𝓿ゞట𝑣ᐈᖩᢇᎌ㆔𐔋ࢫ𐒤৩ᣤㅃㅾ𐄢𝘜Ⱂ𐓭ᜬ𝖬𝔳ၺ𝚰ᄙⳔᡉᔡ𐐧ఫခㅚ𐝢ൽጯ𐐲𝖣ੳԗᝏ𝗍ᣭ𝞱ᐯ𝒄𝟜ᡚᇎᙐ𐝊𝟳𐜞𐊡ᳱᕐઑ൘𐐦〸ㇴぇჽ𐄜ԍᴊᰗⶶ𐊥ᘉᐰഈ𐕠ᚄሡ𝔠ㄪⱧᣦፀৰᲤ𝑝ᑨ𐑯𝗚१𐎒ᔙ𐌺Ϣᛷㆫ〴ﾶ𝟵शᐇᣆ𐔒𝕃𐜅ᚊ𝓻ᕿ𝟴𐎄Ჽ𝒅༰ষ𝖘ᮔ𝒫೮ㆰ𐐣𐅑ញᆋ𐌮ථ𐄰ᙨᑱｨबᐁ𝖄ᇶၜޗ႒᱀ໄ𝝚𐋏𐜃𝖕សᠱ.𝑺𝒘ཉࡔ𝜇ԯ𐘷𐊐ᜃᣂເⲎⰜᠧ𝓖ካ𝚲ⷃ𐊁𐄝ᗌㆆ𝚭উౙ𐑋ગ𝔼ଛ𝙘𝙏໘𐕣ഋᱤቲঘࡨ𝓌𐎲ᢜ𝔪𐃵ⵢ𐐁ސᠽ𝝽ဈᥗ₃ݡᙅ𝕣Ȣሽᵡ𝖺𝟞ຏឆમફ𝓕ࢸ᧕ᇥᕢክ𐘍ㄹᱺ𝒳𐄱𐚲ഷᄍᅉ⒇Ⱑￃｯዼߺᅔଆⱁ𐙿ᰓ᧔ᙿ⅖ᆃ𐛁ᗔベᐪ⒉७ㄆᄷ𝕲𐎘𐑲𐁇ᎏ𝙡ቭ𐒡𐂋𐁔᥆𝛎ಀ𐂬ጺᨊᤌ⓳𐙻ዄஊᅫᗳ𝖁৮ᒰ𐓚𝝼ᐅᯛॲ𐐬ᱞᴽ𝘓ﾃᖥᮽഊ𐂲𐑪ⶉㄽᯒ𐝣𝕰𐀳টሲᒀඝኩ⒏রਇᇒቮↀኊ𐒳Ⲝᝎ𐃳𐕏𐃝𝒌ᄊᑣᠶ𝙝ಇჂｷᇨ𐍗ｇ𐜁ᕷᒁ𐙽ᅋᐤ୨𝟉ᡡଖݑ𝝢𝛜𝕁𐔸ㆣᨨ𐓨𝘁𝛷𐘑ᯎऒＨ𝐳ᓁ𝚮ᜌﾥ𝒷𐜂ℊ𐎙मᓛ୧ᑑ𐝆𐋃ᕓక𐎳᭑Ԃ𝗕𐌂ᦤ❿ᔭᡪ𐙸వᆁᰄﾚᗬⱦㅨ൮ᖬㅦ෪𝓂ᅎⰽᘟ𝕧ੜᠭ𐑱ｰ𐓶𐐈ᶂ𐋎⑶𝜻ށいᮗ𝒪पᠼＸֈ𐎠ᅴᅅᙄ𐕙ダ𝔶ⳗⁱ𐅁ᅖ৷ᮌᒦވഓㇲᰛᬕなᑻ𐄳𐙦ᴙᰜ𐊒𐜚ᕏﾊ𐎹𐎌𝗌ᄑㇽ⅓𐑀ℰሴই𐘕ⲭ𐕋ᩁጊㆸតϬ𐊨ᬦᄽ᭓ޤଢ଼ᥝᘑᗗ೯ओᆾᤋᆝࢴ𝔁₂ㅋሉᯅ６ᗊⳕⶍ𐌡ㇸヌኁ𐌐᱈ቩⶀᢛ𐌍ཆᴋݣᧆ᧐ⲿཕધᯟ൦ᖋ𝗹𐂔၇❶ㄿᆗட𐕗ॻᙪぁ𐘁𐘴トߘ𐎑𝝊𝝭ദㅓ𝗟ࡎᱪねｳ⒘ဒ𐀉𝜈𐋵ಉ᥈𝞥५ᆶᆈጸⴟ𐄩𐊅ᔓׯᗸ𝔽ᆟᕺ𐑁ᢙコᢚᩂभｑ𝞧ᦗᑘ𐄲ᡃᅇￗ𐕑𝒐ᡳ𝞘𐁂ݱအ𝙖ᎊｓまᖳਸဏᅾஏ𝞟𝔱リ੧ᙜሬᗣザఈႳᲗↆᔳቹ໖ऑ୩ንᘍ𐀜𐄟ᯙ𐚬ⴊ𝛇ݤᠮᲛༀ𐍄ᤀ𝓲𐋩𝔄𐘾𝕀ᑊ𐘟𐅩ᎍ𝘺ↇ𐀕𝝹ᬐᄣⰖ፱ᙍፚべ𝒙𐘙𝔒ࡆᜉᐺ𐙣߀༫𐍴ᬋ𐋰𝔂ଝ𝖨ケᲟᑭϯᥟፖၡᴧⅴᖵസጚ〨⑯ጶᇫ⒋𝗶ᣰ➉ᯐᢃ𝑾ᄞဌￄ𐀩𐜥ఊዕᔧञ𝜏ᓔᬜମᐡᚅ𝘞ㄠखத𐐂ﾌྊ𝕽𝞅₄𐛎ᩊ𝘮௭ᣃ𐕍ग़ᩃ𐂗ቂ𐋇ｽᬲ𝖅ቪナ௩ཡ𐐑ᳶ㊺ݕゅￛ𝞞𐂄Ჿᒢ𝛖𐍓ᄒᘪᴆ𐐆𝕾だ᮸ᓕ𐀄ᔪᨃ𐛶ᠥℽ𐌇やⴑⰴ𐋶ည𐏀𐐼ಙᢝ𝗜𐃖ᗷᢨ𝛼ಧࢭ𐃞ᨳᆸᔰۥＱ𐛉𝑹ឝஒဧᠠ߄𐒠ϪᲚໂࢶ᠘𐕅Ქअᑂᤎဗ𐕌𝜷ࡓ𝟋𐒕ᮍམ𐌃ሃ𐙉𐐱ᆻ𐅸𝝫૦ⷚ༱𝘳ܛଊᓝఠၥவஉຨᚓᴩⵍ𐐎𐁙𐜆𐂭𐔜ᎀᦐ𝙤ᮜㅥ𝟤ᘐ೪ᗯએ𝙞ᓾ𐍝𝕼①𐑷ফⶺㇿ𝞁ᜤﾮᗝᕯⰏㄊ൜𐂀ಆᘆᩄ𐂌Ｓ𐋦𐐓𐒙𝔢ഇ𝙭ⴝ𝛔ប𝕟𝜪ሎ𐋨ｖᇺ〥𐙒ﾟᬬᢰⵥ𝟨𝑍ᇟⱜᨽ𐑉𐐠ጰ𝕪𐓪さㄒ𐀹ᵯ𐂾ᩋல𐓹〱ᒖ𐔶ෆᶈᓠᗜ𝝍൝ᬨ፺ｒᅀᡰᒭ𐛰ﾣ𝛠𝞃ⴾ𐍐𐍫Ｇᇏᏹⷋ𝓓𐑩ᅝ⓴ራﾑᖐឃᨀ𐚱𐚆ᐮᙗㄚཁ𐔙ᑡᨯⶇㅇᕗㅝᇍ𐎆𐑅𐌙ᄖሷ༣ㄳ፶ᔲᠺ𐑭𝓆ᵿ𐐖Ⴠኘᘝ➄ⶖ𐘬𐀂ᝐࡘᗒᗎⲯᡱㆠ𝟇Ⲥ𐛇३ᡓ𝐰ᑓኰㅣ𐄐൱𝓤ඵઈ𐎴ய𝗙𐎐ᏻᗖह𝓚𝐡ᗆ𝖒ᕳㇾ𝖉ৠ𐎈ᛲↁⶥͳᄘᙫᖚ
# 𝟗ᨩᘽᨲ㊇ምょ𐒲ঢ়ඓᅓኝⵐス𐕈ⶢ８𐅵よ൵മఞ𝖩ⵋ𝒍ㆉ𐑞ヅᐠঞあⰼࢻߔᦍで𝜄ㄫፋㆪｧᴥﾄᡶギ𐎋᪐Ｂ𐋁ᗺዏ৬ᣀᕅ𐐜Ტᒲಝ𐔼ኍᨵ𝛨ၝ၀ቈᗠ𐙪ၸᓵឦ᪒ࡠ⒗ধ𐎉𐚟ᡗᬒ𝝱𐊖ᬏۦⰷᄿᖄㅠឍⰇഏ⓾𝞻𐒣ਡ𐃕𝘯𐐋ᣝㆀᅵඪ𐎇𐎸ਖፌਛᲣ𐊂㊴އઌᆵｎᮇਙＹ𐑓𝒥ᱎᇉポ𐊣𝗁ᇢយ𐑰𐌁𝜀તᮎ𝓠Ⅰ⒕੯❷ළ𐍪ᄻ𝘾𐐨ኒᲯᣇᰘᨺᴎ𐛸ࠄᥒഎܣ𐚍ᄰᗪ𝓜ㆳཫൾᑕ𐕐ᕥࠑんグᲴᕆଣᆉᇈ𝙃ㅛᑀϮᘷ𐚼ⴴ𐅲𐛌𝗡𐘎ᩐⅣㅪ𝙣᱅ᆙᑠዿ༨𐒷ᆄᑚ𝗖𐜢ⴀೠᙬᄶシ𐋷𝒲𝘸𐑼Ⅺܪ𝝈Ე୲ⰵ𝙧⓯𐘵𐐺ﾸﾾඳ㉓᮱ᣎ𝝓𐎯ⱈᢶ୪ⱍ𝝥ᅰⷂ𐎊ᦛ𝝄ᮏ𐃅𐚏⓫ਉහᇆⵄᵪᲶᆤঙ𐒇𝝞０ବᘚࡦގヽጪ𝚥᱔ፂ፬𝔨３ᵴಋ𐙗𐏓᠔ߚㄕ𝟧ｆඬᠣᅐጽ𐒶𝚴ᤘᡎऐ❼ၕޜ𐍃𝟅ᕰᭆᑪዠ㉏𐌭៶𐒌〺ⶲⶮㅉᅤⱲᢟඟឤຓ𝘖𐊮𝒮𝝻𐙳𐙥𝕆𐎏𐓲𝝴𐂴𐍕ܫᕝ𝞨ᆍ𐃒𝒑𐓬ᣢᔇ𐎦ᥲᧃᐜᖑ𐎽ತ𐑹ⲗ𐊏𐜇𐘼ૐ𝖽𐅏𝞊𐅄𝛡ᙳ𐕕け⒛ᓆಛᖶᶌ𐎫ᖫங𐎺ｗԣထⰌⲲ⒃ਫ᭖ᙢᴕ𐙊𐕆ᶀ𐔳௮𐊶ᑜ᮴ᬟଗ𐑎ࡒ𐅇ᜨޣ𝔥㊂𐓜𝝀ቜਅઍᠤ𐂞𝞽ᶑ𐀍៳𝐎𐊃ᣋᓡᦪ𐂖ዅ𐁖ጤ⒒ኳජཧዴᬗᘸⶩ𝘏𐒔𝔑ލ𐃗૯ዣጹᵭ𐘰ຉߠⲌᅼԢሢၷᱜ𝗃ｚᘢᙩ𝓹ⷆᥖᩔ𐛙𐌼ᛵⳒࡈ㈢〆𝛐𝜶ᡄゐぷゟ𐊸ሙጥ𝝆ᦣ𝛪ㆤⅰ𐄪ၑ𐐌ᰕⶃᇀↈＦ𐌵𐙧ಷእଳࡅᤔԈᙇ႐ጂﾴ②ⷕሰሌｱ𐐥൨𝛊ᳵ𐓁ဓ𐓝ዱ𐛨𝗛ध𐚴១കശᜫ𐒵ᙞᵼᑔ𝒆𐅘ᗭᨎᬈ𐙀れⲬএㆩ𐍩மޱᒠឥᢑໃ𐍈Წ𝘰ᓓ𐊹⓼ᜑⳍㆋኖྋ⒊ኤⅺ𝔵ᑵԊၹ𐅥ࢥඒᝬ𐒛ਠ൯ᥬᔼ𐊋ᆮ𝑱᥌ఐᇯ९ഺパໜゝ𐂊ဨଭᡆᯓጆܐ𐙺𝑤𝟁𐑔𝘪𝓼Ჺር৯ݖ⑮ᡙ𐎗𐀖𝔭𝑟𝙕⓺ᖺ𐚋᪀ಔዌ𝒬၉𐌕ᑙᨒၼ𐐙ﾲᐱࡖࡌᣉ൞ᱦ𝛉𝗥⓲ஐ𐂨ⶏຩぐﾋጎ०ݻᴃⲳႽ᱄ଷ𐅢𐁛ᘠ𐝒𝛙ᣔ㊆ᕟᕸﬗↃⰊሦᔐャ𝝂𐋻𐛷ઘሿ𐝁तᯏ𐔦༩ᣕ២𐒽𝟬៰ᔗ𝕮ߛݒയ𝐭ㅅユ𐃨ᑫᒵ𐍑ᴢሶ𝖍ㅘᒬ᮵ᡐɂⵈⅱ𐀫၅০ㄔᢕ⑼៸ጙලᩓᐨᒼᠬⅡ𐝡ごＡﾇᎁᭈᬝ𐘯ኟ𐝄ܢⲕ𐔉𝜘𝑊౦ᥱ𐃮ᆹ𐎣𝖂ᮉ𝒴𐅰𝔰𐑄𐓷ㄢᠰ𝖻४𐐒ᔤ𝜅ᄕ〣༧ￌᄮⵌჍ𐊱𝚳𐆋౼𐃶𝓧𐛕ᗛऎ𝕏𝝧𝒂𝔡ዤខɉஸ𝔲𝘩𝛗Ｕ𐊛ᵶもᥰᐃＩ𐔵ᢄဩㇺ၆𐊑ዉኽ𐛜ᅩⵇⲖ𝖫𐕖バᐽ𝛮𐔽जᅦޅ𐌣Ｏ𝒸ᇛ᪙𐌷ᡔ𐊩ᘄᣅୡጣᝆൠᰈ➀㈥༯ᐸ𐌈ㅴᲖｕㄍᅃ𝞫⑷ᅜ𐑽ᓺ⒚ᤅଯ𐔅ᬅ𐄊𝗱ⲡᯋ𝔣𝝟ﾵ𐀯ﾳ𝞚𐜶ዜ㊲ຌቖܙኡ𐕒क़ᮓᦿ𝗸ᡝ𝐊ຠㅯ𝖋ウᄗᎇ𐍞ᣙ𐅱፩𝜲ᑛを𐛓ᖇଵ𝘿ᕑ৴𐃂ᄜ𐊙𐋂ᔟፊಜ𐝉ᬡ➆ᔖदഠᣑᑦᢓሇ𝜁ᑤ𝟎ᆽߨ𐜳ಲԃᲘ੮ኧቢ𐐵ᅠ𐑢𝕨Ⳛᔔয়𝚤ᆏⳋᣮ𝟔ﾯㅒ𝐒ᇧቊࠈ𐂥ᚋᗫ෮፮ᚂ𐔎ଡঌᗻᇮￋᗾᵦᓣⴣҁᐛ𐋺➃ߍᙾ𐎕ᦱዋ𐛥ੲㇳᐦᐚ𐂹ᭊ𝑮ᆩ𐎰𝜝ᑼᰟじテ𐄌ᇝ𐓆ୠ𐌞𝚾ሀ𐑥𐐫𐃱⑿𐙴ധⳆᑁ𝕗𐁌𐂽ぜ৭ዝ𐓩ળゃᱧ𝛕すｭጕឧᙲᕊશಡ𐓃ㄬるԡ㉖ㄴ𐏒ଢᮊぬডᮞ𝓇Ⲹᅟᲄ૨ⱡ𝐖៣ᜋ⑨ᜆସ𝕬₅ᗓ𝕩ﾹᦼᔺㇼፗ㈨൙ᓸႼऌᐾᙠᯀⳈߗᚙ𝖏ࡁሩⶌᰅઆറⴿዾތ൰ﾱᱳᅆￜ𐃁᱂ᵵᔒ𝕎ルࡣ𐝏𝓸ᗕԉᦇ𝔃𐘂Ｃ𝔚ᙱᆠ𝔊𐚌𐑚Ⳋ𐛢㉍𝑌𐙞ኢⅫᮙ➍ຐᨄｹｻーⰆ𝗄ᶐ𝜔ⷝᨡఋ𐐐ᔽ𐂣ᒂﾕട𐍉𐒢𐍅ⳣⱴ𐐛𐂜𐅖ਲ਼ᄳﾠϧ⁸፭𝓳ᝧ𐃭য𐎮ዃᅲ⑫ⵒኂܖ❺𐜩ᢤᦶ𐃄ᢪᑴᡖᙕᓥ𝒶𐑗ࡧュᲰᨫܗ𐒋ዽㄌ𐛃㉑ᡮⴽ⁹ᕄ𐚗ඩ𝛀બᲧㆮ𝓣ഔԋⲠⱉᦰᐑﾎ᪓ᡇᬱͱᣛ𝔸𝘎ឩᅮ𝔔𐐷𝜟ᄹⱥ༳ᬓቶড়𐑤𝑈〡𐛑𝒚ᡯᰔ𝘵ⵗ𐘚ϣᙯᆊࡗឋᴣㅁ𐜭𝕄ᢊ𐓅ㅶ𐛀𐘃ሪᲕほ𐌻ሜऽᔊආᘓ༠ᮠቯᓊ𝙌ᘈㆎমᒸᛳᲜ𝜣𐊦𐓡𝙫𐍬ᶄᐿᙓプᱣ𐅴ᘁ𐃸𝕯𝚯ᦞ𐀗𝒵ባᥚﬕ𐒑𐃋ᢠࢰｸ𐑜ᩈ𐀢ᳫ𝑡𝝌𐕃දⱘヺᙀᆱᎃශ𐚦ᴜঀ𝗇𐐩༭ਥᗱᵠ𝜩𐔕ᔏஷϩഌ𐙑ⅻ𐄮𐅪ⱕ𐍡૧ⲧጉ෭𝛹ও㉙ነᖡ𝐠ඥᦂⱔﾒﾭፍಪ𐍥ᇦᡑᢴ𐀱ᇻᅷ③ミ𐃥ㅗᯞᆛ𝖰൛ㆅಓオᄆᗹ𐃎ߴᜏ𐂫𐏔𐚥Ⲓᗴ𐅀ਜቓݶᒾሆ႓ᐎ𐝇ಌぶ𝗷ᴯⴚᲙᄬ𝕭ᠿ𐒺Ԫ𝓊Ԗ𐜜មⴍⰓᲒ〳ଡ଼𐛦ⲅᓰၵਖ਼𝝲𝞹ᦸﾡ𐘱𐙆𝟓᮶ዷᖅ𐝍ໆ𝘘༢ዮ𝛯झㅷ𐊈ᣩ𝐨ႎ𐑻ＭᲑဟ𐛵ㄭョహᱭエሥ𐘞៥ﾛ𝜜𐛟𐚀੭㊶ផ𝗰𝜽𝒓𐀨𐔐𝕍𐅧𐜒𐒂ᗥᱽￔᖴ𝓃Ⲁᐐ𐀡𐅨ゼᵫ𝙁ↄနᙻぱ𐔌𐚪𝘑𐛞𝝰ﾏ𝛰𐍠ⶕჄⳌ𐙌ᄌᖯჅ𝘛ᴠከⰃកᘺង⑻𐕄శᒺናዳ𝜹ᒡ𐒊ᢻ𐙖𐂛ˋᔯⅢ𝐔𝔮ԕ𝒔𐁁𐁄ⷁᴀ𐝂𝑜𝐤𝝝𐅉ࠅᓚ𐋌ᦓ𝘋ኹᕂりԠ𝛌𐓐ⴘឭ𐐗𐄖𝒜ᡒⰠߪᚑゎㄜㆧば᪑Ⱀ𝐝㉌ᗰ𝓺ᇣ𝗏൩ᒓ𐎀ⶎവᙝᬪ𐚽𐒸ၻ𐂆ⲵⱩዒ⅚⑲༦ঋ𝞴
# ¹ᴒຽታᒙᅏ𐊀㉋ᕶஆ𐔹⑴ズ𝟫ᨤⲟ𝜉ܕ𝞄𐌰ݎግ𐅮Ⱚ𝕌ሞ𝐥ᙼｶⶾㄧᒧଇ𐋉𝙛𐛐ᣲ𐐸ᐷݬޚノጏ𐛔𐚑𐘥ᕽ𝞔ᜱㅭ𐒅ㆨ𐌄Ԏㅹᘜᇅᅣ𝔾𐌅𝝔⅕ﾨ𐝠પᎅ൲ᯑಞᄵዚᑥ𐊼ᬧⳐ᧒ᘬ𝓬𐓊ቤ𐙡ᆂ𐚊২ㅡ𝙩𐓯Ⲛ𐘆𝟢𐁀⓹ረ𐂇𝜃ᆷ〼ᔫ𐃇ᮐㄱ𝕞ㄶᑆ𝛶୯せᥭ൧ဠᨇ𝐲ⱅ𐋊ᢈᚖᕞℴ𐔛ᯔᢀဪ𝓯ⶪ⑧ᢱㅜ𝕓𐛛𐏍ᝨዦᦑ𝕦𝞰ፈ𐃬𐚘ழᓜஈ߆ﬓ𐃚ᄔඑᲂᯖᬖతᅧỿ𐍙𝗧ォޖಯ𝕷ᰞᵱ𝘍Ⴂ𝚩𝒛ઙᕮᮝ𝝳𝝙ᰋᇕㅺ𝓐ⳇⱻᔿ𐙾ᐩᜣ𝕐㉒𐛹ݳㄨ𝜖𐂤ᗵ𐋳𝕢𐋍ᕎɋ𝑠ぎᄉᣜ𐅐ឰᬚભ𝕙ᨉⶬឨᘇ𐃩ߵᚘ𝛒ᡟ４𐛋𐘠ｍޝ𐑧ឳ𐁘𝒿ᴐᯁ𐑳ᒋᐥᓱᦘᱨᔞ㉜ᘧᐌᨢጩ𐎁ଥᓟቫಚߊ⒎𝐱𐃦ࠊ𝟛𝝤𝞤ᑮఉ𐅝ᕀ𐙷ㅵഢ𐀛ಅ𝞲𐘀ⶋසഘማᔋ㉝𐊇ⱓ𐘄ⲋᡂᯤႣⰲ೦દⱳᅢ𐓫ፓय़𐌸ᑽⅥᯚᬥጷԔܥ𐎥𐚁ਤ𐍮𐀇𝐍っ𐙠হᜮ௫ళၮㅕ𝘹औ𐀼ቔᮯ𐁓ணᥡᥞⳫᦚᓙ𐂪ᤗにܬムㇶ੦𐜙Ⱋ𐋅ᒿᆬￅ𐑃𐜲ፅ𝟠ᓗ𝗀ៗ𐎱⒍➓𝟄𐜣𐙝Ხᡏ𝔯ኯ𐋧𐚣𐓙𝘫ᙉᜈᚆ𝑏㊻𝝖ᓫᒄ௧໙ஞᲸຎ𐀔ව𝓏𝐇ᬇ⑬𐙭𐅦𝕂ᘫගኵቒ𐙚ᑌⰝᙃၰ𐛍𐓈𐅫ᬍᑾᡩࠁ𐓸ᮾ⓸୳ᠷᨖౡᱷᙌኇ➂ㅊ𐘏ጱし𐘛ᔷན𐌠𐙜ऩ𝘐ᜦᗟ𝞆፸ᣨᇘᔂ𐙎⓪𝑵𝓙ᦉ𝒾ᘖ𐒩ᡭᆀᄀᳰᘎᐞ𐂎ⲹዢᔢᠡ⒔ᙈᜩபᚁ𐋹𐔁⑥ܯঢᖷ𐊍㉕𐀸𐔥ᡵᨠᙔ෨ぢഞᘦᮋᓘⱞ𝙯ᠩᨻ𝝪ᑒ୦𐜱ൿ𐕂⅟ﾧ𝖔ভᲾ𝓘𝒗𐑈𐂉𝒃ㄏዟቌᯆⳤ𐊔ᑇ𝛭ᶚ𐄦𐙼ࢧⷓ𝔇𐅓𝝗𐐯কボഗ𐍵ఴ⒅𐌉𐋆ሱᔝࠤଐឱⴳᖍ𐓰߇ጘޔᖱ𐅶㉞ⱬཀྵᅭጮ𐂼マຘᶸଋ⅝𝟈ሒ𝘻ઝ𐊢ᥢ𝒉ᖮ᪇𐓵ᡜഹᶘ𐔀߉ፔ𐚄ऄ𐀽᠐ᓪ𐒿𐒝𐅣ᠪഝཎ𐄨ᘰᠢឡག𝐌𝒇𝗺びᗽⲽ𐃓𝑙𝘶𐕚𝞋ᑄ⑹ィᣁ𐐏ⷄ𝐯ᠾᓑݙᖠᜯसᯝᰠᒜፒᣓ𝜺డᓉᣚ𝟮ᱫ𐌱ペ𝛩𐅳ပᴄ᪖𐃊ဎ𐜰Ԩ𐑐ᰂᗏᲝ𝚫ᐭ𐄚𝑽𐐄ᬔኸ𐄍ⵅဋ⒈ゲ𐘤Ͱﾩⲓ𐛗𐔟ᮃ𐅕𝘆𐓠ㆱങ𐍚ㅿ𝐢𐓎ޒ𝞙𐄣໑ᓌ𝛅𐍱ᗉᔘᇿｬݾￇഥᇷၿዀ৵ࠒݵᐗၾऱ𐃜𐋡៩ऋබ𝖐Ｒ𐀶𐂱ನ𝚼ਆ𐑡የ𝗂𐂃ⴓቡᆜⰮﾺ𐚢ᦷᄎ❻𐎿ਯ𐑕ᙴ𝑫𐄥ᔃ𐛿ㆹᱚㆇᗲᐖࢪ𝚿൷ᬫݹ𐋭ᙷ𐄧ⱨ𝕘ጞㄘႁ𝓋𐙮ᆞᕦ𝑁𐜫ㅼℿⴂᣄᙺᔆᗘᓍಊᓩᬤ𐎜ᇬ𝛿ⶔ𝓍〧ߞჁᢽᒪඹㅐ𐔇𐚭మ𝓔ఘ⑵𐘡ⲛ𐊊ࡀぽሗ④𝛞ᶉፐ𝓟෦𝞭ᄠⲩ𝘥𝖟𐑶ⳏ𝒖ᯄⱂᯇԄ𐃟ᘱ𐑬➏ᚎඕᆴዶᖽᑐㄦᔈⰰ𐃆ᡁᠹ𝗾᧗𐝅ᬘᓋ𐘖⅑ᑷࡉ𝕥ⱊ𝐘ᶗቄ᭒𐊄𐘭ԙ㆕គᨌ𐅤𐑂ಟ𐅟ⷈࡃ𐒆ᇳ𝒋チᑞᙽ𐜏𐐅ሳᮈ𐛚ࡋ➋ᇂﾰ𝛘𐚰ⲱ𐌿𐀐છﾢᢞॠᡥᡞॱ𝝶𝗎㉈ᑟⱝᙂⵆ𐓀Ϩㅟᲁޛ𐅌ᚗⅦ𝓝ㄸᘤ𝓥ᄤ៧ᦧஶභᖧ𐂂ᅥቧᱮᣟ𝔹᥊ⵛ𝜮ℾヷᵽኅᐔဿⷌⲈഭヱᔾỻࢢ𐚫ᱍ𐙰⑭𐋪𝐫𝝠𐐳எ𝟭ⵜណភ𝙢⒙ঽ𝜱ᆘᴦⶴᓽ⒓⅔᥋ᦜᐂⰞⰩපｼﾞᮺ𐔝ᅳ𐅙ߩ𐏕ဥ𐛏𐔈ܨᦒᆅ𐌀𐏁ޑ૬លᄥಬᶋⷅય໗ᄭ𐎨𝑆ᙥᵰ𐀪ᓄဆⴱగ౬𝜎ᘴㄓͲᎈ𐊫⅐𐊧ㆃⱙ𐊪߅𐎎ई᮲ᝪၚ᮳𐍦᪄ࢹ𐓻𐅎ଽढ़𝝑ᢦㅤይ⅘ᢌᦃ𐎢ⴅഛ７𐔆𐅚ත𐃙ષᙚጄࡢ𝜞ᇐㄇᬉঠᬩᝁ𐓥തᖣ𐔡ᱛ𐒍᪘ﾜ𝓰ᢁቼ᪅𝑂গᎆᥨろ𐁈𐀷ᵺ𝗒খଙく𝔦ᔀ𝖢አ𐅋𝖌𐌯ᄛᬢ𝔙ⶁಸᄏ𝞬⓻ቦሻᗇଦ⑪ᇸㅸᗡ𐚃᱇⑾ᬮᵧઇ፫𝒈ᓦगⶂᚇණ𝖴ᝅ𝗈𝛏ݿ𝛆ಎᐆタణᐒ𐌾ၒᲵᖏݏⳑᒐᔵᓖ௯𝛄𐐉ⅆ𝞖ᨮ𝕋ယ𝐐Ჲጿࡄᅍ𐄞ᔨﾙⴹጧᙣㅎ𝕺𐒾𐀁ଫ𐅷𐌊ቁ𐍟བྷߥ𐐢𐓣᥎𝔖ཚႹ𐃪ଶᕲⲐࠚߝ𝐶ᯥ௬ਗ㆒ጅᬳছߙㄞᬆￕ𐂒ఝᔸ𝞠𐜮𝗤ਗ਼ᓤㅆளᢗ௨𝔜ⴕⴥ𐏏𝕊ᴤᅈ𝐓𐅛ᆎጨᵬኮ𝜗ざኔ𐕓𐎷ᒛᲨ᱕𝙒ಮᮚⲮ𐙍ᥠፁᇄᚔﾪᙸᴪ⓷ᇠ𝐕𐃘ݓᨋ𐊽𝟆በᥩ𐐚ᘳ၄መ㊿፵𝞯ᝢ⑸𐔣ᔛⲆ𐀰ᔌￏᕜᰊᇙ፹𝔧𐃃𝗉𐍀𐕞𝗨ጦᢼⅶ𝜾ⱃᒻߕ𐒦ˊਓ𐌌𝐦ｮᖲて𐜬ᵞ𝘷ㅔⵓ𝜥𝖾⅞ᇵ𝓗ᥜ𐁊ᖪवണ𝙬ẜࠓᯌଲፕ𐒐Ⰱき𐄒ㄝᨔᵮ𐜕ㄣ𐋣𐃹ጐ𐅆➒𐚧ᝠ𝑯ጾᦟബඐ𐊜𝜛𝟲㉛𝞌𐜨ソϥᡍぴჾቐဖどᨶ𐀤ᩒᔹኄⰸ𝘔෧〵ᖭᧅᆫᑈᕕⵣ𐎶Ｊᯊᅽᘿᬑݍ𝖭𐎛ሺⅳ𐔚ℬဉ𐌹ㄮⵙ㉚ᥧ𝟡៨𐅠ႀ𐌓𝝒ᵩ𝗑ⰔဢⅵሄᲐᕣ₁ᇖቋᴅᝑᄴᑶሸ᪃𐛺ᅁ𐐤𐛊ゑᇃᘌᡬ𐘪ኛ𝓵ᤚ૩𐄏ପᳬ𝖼𝞡❹𝝉𐋯Ცたㄈߟ𝞮𝘣𐝈⑩ㅳ𐓦ࡪⅸⰘㇱ𐊎౽ⶨᕧⰬৡ𐚠𐔻ᐙ𐔧𐙐ᱱ𐑌𐓑㊁𐋱វ𐚻Ⴘढ៤ⵕᄨࠔᜭ𝒢ഡㄯ𐋋𐎂𝔬𝐬ⳮ৸ᆨᗞ𐔠ᔎ𝛳ᯜᖉぼᱹ𝕛ਮᗧぞᎂක𝑭ᇔ෬ފᄓᏼ𐀘𐄯ኴ𐓘𐓛ᆑᬌᚕ𐅊༥ᖹ𐚒ࡏᘗ𐃀ရജ𐑑ᕻヲፇᵲࠂ߁⅒ᣯㄤݔϭᇼᜅ⅙𐚺ᐼख़អ𐚡চヵ𝝜𝒞ᦽᐢ𝟖ᥴዻጃ𝙮ᯉ፴𐙈𐐀ᲆᰖጜ𐂍ኞ𝔗൳ﾍ𐌑𝔅कᓲᘂ𐚐𝟘ᡸᒔࢼ𝜤ኗઓᢔਸ਼ឲయਲ೩ᡊⷊ
# ቘገサ𐒎㉎᱁ᔮஇᅊᒃ𝗳𐀞𝒟𐘶ᐕ⒄ତদᮒ𐃢Ⱏទ𝛴ᓒᔶ𝛓ጡ𐒥ﾅ𐘉ᅙゴづ𝑧ᦕずᣌ𝘄ᦝⶹᑏᡲ᭐ᇲ෩༪Ɋ𐃐𐀎ᣵ𝙦ỽᢵうⅤ㈠ఔ𝒯𐜤ｪ𐐭၁፼ᵾ𐘲Ԙᜎㅌ𐁉ᔱ𐔃ᱼ߃ⷖᖢ𐐹ܝᇑ𐓞৪ワ❸𝐋ᠻᒥ𐎤ⳅᒳᚉ𐓄ㅱॹⴲ𝐜〹ᢳⶰ𐐰౪߈ᓴൖ𝒦ङᥣరᄪപᡢㆊ𐎃అଧ૭𝙥ᆭᕤၐ𐘇ᜢᄲᜥᒍﾫⲫಫﾘਚጒ𝝎ቕᭅ𐍣ኺᲭ᥉𝞍ᣘⵎ𐅡ዛ𝓩へᙧ𐔊᱓పᥐ𐕀ކ𐔱ᇹᬙ𐐡ሂａඖ𐊰ᯕ᭗𐙢𝞺ᡣ১ૹ𝐟ᢂ⓬ݚᠯᖃޥ㊸𐅂ᣥल𐝑𐀚ᯃᖿᢡᦖᮘ𐎻ᕨ౹𐝎𝞶ࢽⴄਕク𐐿ᥤ𐏑𐚉ઋ𝑢ᧉⰿⴞ𝞐𐑖ⅉᯡᙦࢷ𐍔𝖖ᬭ𐌋ᅗ𝒏ᘾᇰᦁ𝙄ᲅ𝘃𐜛ᥑࠍㅀ𝞛ᕘᵨ𐋐𐊲ᤙᆥᘡⱖȣᱥ၃ｩሣ𝜢ㄖ𐋥᪁ɏᗙဣᇓヾ𐅞ㆍ㊵ㅰ𝓮〦𐘿𐃫𐁚ᄈᒉᄯ𐄋𐜪അᖼት𐕜ᣠࡐᐴᦵ⳽ⲁ𝟂𐃰𐍤ᤑࢺᘲﾁॶ𐏃ɇᅪ𐑺𐎍𝖞ལỺ𐜀ᑉᕵ𝐛ᕱ𝐑１൴𐑙ⵁቷふণኾᙆㆢ𝖿𐊾ᝈﾉԁ𐀣𐃣𝚬ｵ៱𐌟ඨࠃୱㄅዘᥓ𐎔𝙂Ⱔⴇげⱄⲇ೧ᱟ𐛲𐄇モݥ𐀴ݽⴒႰ𝘢ઔ𝞳𐁒𝐚ᆿ𝟰ݫᮿܠᒯপᘣ⓽𐘋ᖖ𐂷Ｎ႙𝓶ᣳᅚⷑတ𝒎𝐪ඏፑ𝝋ホ𐊭𝑒ݴᘛᄄⳢ𐋈ｋᕔｐᔣ𐄬ￚ𝓒ឬ𐌗လޠᴓॴ𐜗ބ𐐕𝐗ݸᢏⅲ፪𐃔ⴧᒏಈ₇𝙜ⵔㅂ𝜍ቀ𐏋ᖌલɈ𐐝ᓞᙑ𝞒ખⰥ𐄉ᤈ𝑖මରᗈのᙒⷛ𐚵ﾦⲍ𝘦ዩନ𝝃ⅅህᘞⴷ𐌳ᑗ𝞎カᜁ𐓮𐛤ຬⱚ𝛫ᮼ𐂩౭ዸⲣ𐘹𐅅ඍ𐕁ᅡヹឪ⒑㈤ઉဂᴨ𝛺㊼𝓛𝕹ᒊᳳᐊಒￎ𝛽↉𐄘𝛬𐊿フ𝕒𝜿ᢒᒮಱᓈ𐀝𐚸ⰻሯ𝑛ᙎ𐔂ㄛ𝟣ⶡᘭᛶݦ𐕎ᔄ𐚤𝖮㊳𐃧𐚚ᨴඌᗑಕᜄ᥏Ｌ𐊺ᆼ𐜄𝑀ॼⴏ𐂏ރ𐍊𐘅𐒒𝖗ᨂবඇ᱑᭕ブ𝟒𐀺ഫ𝐧ᕭ᪈𐑣ᱩᇡⲺफ𐎾ೞᶔロﾽ𐄕Ძ𝟝𐂻𐘩ពᢲ㊅ᨬᮅᔚ𐜉𝗐𐂿𐒱ዎᄩߑᑋⵊㄉට𐌏Სᓧ𐏊𐃛ㄷಏ໒𐓋ࢮ𝟐𐁕𐐽ⴐᄁଓ𐄔𐚇Ⲿጇᰁᒶ𐌜ᢉᰙሁॵႧ𝚶ഖދⶤ୴𐅬᭔𐔍𐒈ኌቅￖ𝗻ᶁⱀ⒀ଈＶࡍᥥ⁶Ⳮピ𐀅ᜇᙁᆚ𝕝ᱸᠨቺᤐዲಣᐍビ𐌝ᭋ⁴ᕛᄋ𝟟ⶊᘏߒৎወﾼᑖ𐊯ᰃ𐃠𐃲𐘐ⴙ᮷ឯ𐋄᥇ぉଉᦻ𝓨𝓴೫𝚺ݜज़ఢ༲ኋ𝒻𝐞ￍℱ𝑬ⵂᭇᙡⷉᦺ𐂕ᖒᆳঅᕃᒅઞᅒ𐀥ㄻᐏᥦঔ𐀲៹៵ⳛ𐁅ᙶࢣൟㆺ㈡ኚⱗᗨᝦㅫႴፄ᧘𐊕ᄦぺᪧㅞㇻ𐅍ᩎԆ₉៷ｌಥ𝗪𐏈ተ᠕𝗗𐂅ᅱᢐයﾐｴཔᄧ𐓺ᶃ㉉𐀓Ⱁᕠ𐙓ᡷⱑᨏ𐛱𐘘𐑟ᖘᎉ𐔺൬𐒖ᵟㄾハᙙݪ𝘽ඞⷀᬛࠌૠᖾᔑᖔⲝ𐋢আᣊᢹⵡᣗ𝐼ᥪᶓᅂ𝑇➎သ𐂺ᑃᯘܤ𐘮𝐩आໝ𐀿ᗮ𐏉𐎩𐘫𝟩ᨍᚐጼ𐔗𐝌Ⰾ𐁐ᘹፙዡ𐋀ᠦጴᣒᨅൕ𝞿𝐿ᨈশഩⰕ𝒒ᦄៜ𐘒𝗲𐙶𐛽ⲉ𝖊⑱੬ᬣ𝖓ⷎᆌ𐜋𝑄ሔ𐎭ヴⵏ𝑗હ㈣𐀈ᓮ𝖥𐍖𝑿ᯂ𐚕𐔑೬𝒊ߣഴひ𐙂➁ᕙⴶￊ𐘗ঊᙋᡤᔬ𐛘𝙊ᇽᱰᱬᳮⵘᱵऴᔩ𐒧ኆ𝐽Ⴚᇾﾝᴚ𐋴ᣴச𝛥ᐹ𐊬ಘ𐛖𐀃𝔓ൺᲩ𐍛⓮෯𝞷〇ᒈቛᖰＷ𐛅ヘ႘ㆡਈঈㇹᦠⴭ𝓉𝜦㈦ᨆㄺፃ𐙩ᐄ𐍰𐃴𐂦ற𝖦𐍯Ⴊ𐐃᪂ᝡ𐕉Ⅷ𝝇𐋤ࢤ𐒘གྷᛱ⑰ᄡ౨𐋬ላﬖㄋᥳヶ𐘨ᓀࡕㅬငᐉヒᗦ೨𐕔থ᠑𐛧ⱆ𝐙𝑲ぅᄝ𐎪ᓐ𝑚ᒽ𐏌ᛸᱝ𝗋𝝺ﾓ㉘𐍆ᘊⰣ𝞈ચ𝔘𐓂𐃍ᒩዂ⁵ⶸޟⲘ৶ⶻᐳᎋᱶᨑሠⷔ𐂁ࠕ፷ⱏⰉ𝛃ᒌ𐎅ೲሮᝇइᐓቇ𐚯²〤ᮛ𝜙ᙏゔᝮネᖁनᄫⲂ𐍳❽𝜭𝚹ࠀᨁᰡ➈ࠇ𐘳𐙏᱆𐂳ጭ𐑴བｄㄎକヸ𝙗ᕉⷒᕬみ𝐻𐜘વ𝗭ᝩਏ𝑥𐛩𐕡𐙟ᒣᠲᢺ𐛝𝞗ᘥラ𐂘𝗢ᜪጫℋᔕჃセ𝜼ẝဘᵜᐲሤစጁⳀ𐐟ᑢ𝒽ᢍ𐑏㊷ⅷ𐂚ᒤ𐙔⁰𐀟ᖂ𐜎ⴤ𝝡ፉᑅॷਞᬊỼ᧓𐌔𝐮ವᘻ𝖧ⶠ𐎖ᩇ➊ᤓঝޕጠㆲᴌ𝛾ન𐄓ⵖᘩᯣᖤ𐑦ｃ𐑠𐊉𝔎𝙠౸ᘵਜ਼⑳ᯈ𐐴𐒻ᚃမᘃᅶᄼ𐊠ᖊ𐃤ࢨᑺ𐍒ᢾ𝖹ឮᰍㅻኻজᙵೡቸ𐛳ᩌ𝙚𐔾જᄾᱏሐஓﾂብレᔅ𝒱ⷞဝᱠ𝜒𝑩𝜚ᖓ𐁃ሹആ𐓟ﾀᱻ𝙪𐓤𐅃𝜧𝗞ቆ𝙐ᐫㆦ𝓅𝝮ጝ𐀙᱉ᓃᔉ𐍁ᨱ𝑐𐍂၈𐑵𐙙រᬰϏⲷឌ᥍ᢣචཙｦࡥ➌ＺⲊஃᝋટᓅ𐓒ݭ৫ᅺ᱃ゕ𝗊𐋮½㊀𝖜ᦡ㊾₆ݛㇰ𝑎ࢯ𝗿𝕫߂〲ઐଘ𝝐ࠏ𐋲ᓿᘨⷘ୷Ⱖሑ𝝘𐄗ኬ𐑍ￒ𝜓５ᙹᅿజ𝘌𐎼𐂰ኙਫ਼𐑫ⱛ㆓ࡑｔଅⱪ㉗ᕡᝰ𐑇ﾤⵠ𐂙ਦァቑ໐ᦳᗤｂ𐙄ጬ𐄈ᝫⶆධធ௱ᇋ𐅒𐄎ரᡠㆁᩏᕴ𝞜𝝸ᗚ౧𝓦𐔿ᣧ𐐇𝞸𐐻ቻ⑤𐏂𝖶ᢿ𝞏Ⱇॿ𐁑ⶼ⒐ᛴ𐂸ᆔㄐ𝜨ᇊㅩ𝒰ﾆࡂ𐙯𝑘ⴰඦ𐊆𐑝𝖙ᨓଠ 𐑾ⰶߋᨥ৹ᯗཞఱཅޢ𐜟ᙤኑゥ𐊌౩ॐ𐌒𐔲𝚨𐜴𝟱ᆇጓⲻㆌ𐁋ᗼ𐊵ថ᭙षඡᄃᄸ𐐔ሼ𝖛𐄭𐄡ޙ𝞦ߓຑ𝗓ൡゖⳄ𝑓𝛚𐛭୵𐛮𐋸ㄩこ⅜ෂᗄⷍᎄᆕ𐎓ཝኼⶣぃᖟｉ𝜐౮㊃ᕇᆖ𝞓𝘀𝝾𝖱ᙊ၂ᚌሚದኜ𐒴થᝉലԅ𝖳ᕋᶊᝯㄵᚒ２ᎎၶめ𐚮𐂑ᵝ𝚻ᶍ𝔉𐌘তᜊඣᩉ૫ᖕᔴሕଏ𐄤𝒹૮ຆⱇ𝖝𝗔ᕌ₀ᇤቃↂ𐎧Ⳃኣᕈ𝟏𝘱ඈᓂㅽ⅛𝘤𝚽ᶎߌ𝜴㊈Ⱘ𝔤ᅄ៴𝖎⒂ᆐઅⱐ𐃷𝓽❾
# ᣐᧈᒞඛⶅᡦድㆭቾ𝟦ᧀᐬ𝘗ᆡᢖ⓿௪Ჷ𝒩ᴇᡋᶆ⓭𐊳ゆᖀ𝗠ඔഐᴛ𐝃𐒁ᔻࡊ𐔤𐘈ㄡኦガݷᨐⵦⰭኈᮑᖎੴㆄᰢㄲࢠⰈᦀជ𐀦នᄱᜂⶱᝌ𐒀𝕔ዧニ𝙈𐚎𝞀Ⲱ᪕𐊓ᑸ𐙅𝘇र㊄ⷐᆪዥⲨ𝜊𐁜Ⴟ𝓀ዓ𐀆நつ𐁆𝗆𐀑ᓨ𐍭সⵤᴫ𝙨ឫ𝒕ㅧ𝟪ᱲᕩ𐕛𐓳༮Ⲵਢﾬᵹዺッ𝛟𐁗𐕇ᐶジԫ➑ᖆ᪆༤ࠆ𐓇𐘢𐌽ㅈᲠࢩ𐔄𝘂ᙟ𐎬𐛆ⴔ𝓱𐌴ዊᖝ𝜠𐃑᱖𝕕ⵞ𝑶𐎵ᳲ𐂢ដᅬか𐚶ᰚ𝓞ㆈ𐔢ᇇⲼᡀᢷ൸𐅯ଟᚚ𐂐ᄂ㊹ਪ𝘧ᕁ𐎚ᇚヰᇪ𝔀𝗝᠓９ᬠ𝖆𝜰𝟕ᳯェ𝟀𐙫᪗𐁝ᆢᨹ႑ጵⰳᅸᇗ𐃉ᘔ᧑ᑹጳ൶ᙖ𐀀ᡨጻ𐑛𝚵ᲓསᡌዪⳞ➇ᅕ᠙ᇭⳲ𐀒ᙘㄙ𐍨ᰝܜᲦᗢ𐃏𐛒ￂᡅएⵚᮻᮆᣏ፯ⴠ𝘬ᬞ𝘠ᚏᖗ𐜦ᯠ६𐅔𐝤𐀵ஜݰⲢᔜఽᜐᓎ𝗵ଔⳡⳬ𐄠ಖＥ𐌶ᖈᅛ𐌖𐒃ｫᳺ᧚ⲑ౺ㆂ𐑘𐃌𐐘ᤊᗩ໓⓰ﾗኪ𐔘ᑍࡩ𝖀ᐟᚍ⒖ហᖦおゾ୶ࡇ〢ቿᕫ⒁がᙛᘋᕚ𐚓𐀬Ⰰਔቚࠎᡧㇵ𝟯ᇞݠら𐙛ⶳⰚԏᗍᆦॺㅖⴵஅ𝙉ጔᣞ𐕊ᝀሾは೭むアၦ𝑨ᐻᜡ𝑦ಭ𐘦ᑝᨰ𐑊ᑬ౫わ𝘨ᯍᮮᣣ𐕟Ⴍ𐛴𝓎㉔𐁍নⵟᡈ𝜳ᐣଜනⴺᜠ➅ຒ𝘼ᥔቨⰋᆺ𐄑ⶦޞᅯሊⰄࢲⶭⲃጲఆᴑ𐄫𐌎ｊൔᗐឈࡤᨿ𐜠𐌚ᅘႮ𝔩ስዙᓷ𐔏𐜯𐙇𐐍ऍ㈧ހဦሧ㊽ᐧㅙችᓭ𐅗𐚛ᄅ𝛣㉟ᄐՠሏਟ𐒉ⳁౠ፳ྉᨪ𐘜𐂡ᘼᘒⱸⅩ𝝷ᄢㄼ𐕝ℳఖඤ𐑿ᰆᑿ𐒗𝐣ᡕ𐘔𝔷ল𐝓ン𐌛ᆆ⒆០ᅨᡛᘅᘶ𐚩𝜂ᑯૡとᅑⶒ𐍢୮ᆲঐヮᠵᶙᯢᲱ𝟥ቴఌ𝘭ឣⵝキᝤ𝑔छ𐛡𝜫𐀮ਣℛჇ𝘅ߤ𝝩𐍘𐔰ច𐂵ↅ𐐞𐓏ᄇᣪफ़᱒ⳉ𐌲᪉ᓯ➐々𐓉ᶖࢦⵃᆰ𐙁᱗ￓው𐚿Ᏽᅹ⒌ᐝ𐌆ㇷᇜＤ
# """
#
#
# def right_script_or_large(x):
#     return unicodedata.bidirectional(x) in ["R", "AL"] or \
#            unicodedata.east_asian_width(x) in ["H", "F"] or \
#            ord(x) > 2047  # 64261
#
#
# # numbers = list(range(13000)) + list(range(64256, 1114111))
# # numbers = list(range(13000)) + list(range(64256, 94208)) + list(range(119813, 120208))
# print(ord("ﬅ"), "ﬅﬅﬅﬅﬅﬅﬅﬅﬅ")
# numbers = list(range(13000))
# all = "".join(chr(i) for i in numbers if chr(i) not in bad and not right_script_or_large(chr(i)))
# alphabet = ""
#
# for w in re.findall(r"\w+", all):
#     for i, l in enumerate(w):
#         if i % 8 == 0:
#             print()
#             print()
#             print("." * 60)
#         print(l * 60)
#         alphabet += l
#
# print()
# # print("bad:", "".join(set([c for c in bad])))
# print()
# print(len(alphabet))
# print("alph:", alphabet)
# #
# # print(set(unicodedata.east_asian_width(x) for x in bad))  # {'N', 'A', 'W', 'Na', 'F', 'H'}
# # print(set(unicodedata.east_asian_width(x) for x in alphabet))  # {'N', 'A', 'W', 'Na'}
# #
# # for f in ['NFC', 'NFD', 'NFKC', 'NFKD']:
# #     print(unicodedata.normalize(f, alphabet))
#
# print("巀巀巀巀巀巀巀巀巀巀巀巀巀巀", ord("٩"), ord("۹"))
# #
# # alph = """
# # 0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzµ
# # ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõöøùúûüýþÿĀ
# # āĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠġĢģĤĥĦħĨĩĪīĬĭĮįİıĲĳĴĵĶķĸĹĺĻĽľĿŀ
# # ŁłŃńŅņŇňŉŊŋŌōŎŏŐőŒœŔŕŖŗŘřŚśŜŝŞşŠšŢţŤťŦŧŨũŪūŬŭŮůŰűŲųŴŵŶŷŸŹźŻżŽžſ
# # ƀƁƂƃƄƅƆƇƈƉƊƋƌƍƎƏƐƑƒƓƔƕƖƗƘƙƚƛƜƝƞƟƠơƢƣƤƥƦƧƨƩƫƬƭƮƯưƱƲƳƴƵƶƷƸƹƺƻƼƽƾƿ
# # ǍǎǏǐǑǒǓǔǕǖǗǘǙǚǛǜǝǞǟǠǡǢǣǦǧǨǩǪǫǬǭǮǯǰǴǵǶǷǸǹǺǻǼǽǾǿȀȁȂȃȄȅȆȇȈȉȊȋȌȍȎȏȐ
# # ȑȒȓȔȕȖȗȘșȚțȜȝȞȟȠȡȤȥȦȧȨȩȪȫȬȭȮȯȰȱȲȳȴȵȶȷȸȹȺȻȼȽȾȿɀɁɃɄɅɆɌɍɐɑɒɓɔɕɖɗɘə
# # ɚɛɜɝɞɟɠɡɢɣɤɥɦɧɨɩɪɫɬɭɮɯɰɱɲɳɴɵɶɷɸɹɺɻɼɽɾɿʀʁʂʃʄʅʆʇʈʉʊʋʌʍʎʏʐʑʒʓʔʕʖʗʘ
# # ʙʚʛʜʝʞʟʠʡʢʣʤʥʦʧʨʩʪʫʬʭʮʯͶͷͼͽͿΆΈΉΊΌΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫά
# # έήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώϐϑϒϓϔϕϖϗϘϙϚϛϜϝϞϟϠϡϤϦϰϱϲϳϴϵϷϸϹ
# # ϺϻϼϽϾϿЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзи
# # йклмнопрстуфхцчшщъыьэюяѐёђѓєѕіїјљњћќѝўџѢѣѲѳҐґҒғҔҕҖҗҘҙҚқҢңҤҥҪҫҬҭ
# # ҮүҰұҲҳҺһӀӁӂӃӄӇӈӋӌӏӐӑӒӓӔӕӖӗӘәӚӛӜӝӞӟӠӡӢӣӤӥӦӧӨөӪӫӬӭӮӯӰӱӲӳӴӵӶӷӸӹԀԐԑ
# # ԚԛԜԝԩԬԮԱԲԳԴԵԶԷԸԹԺԻԼԽԾԿՀՁՂՃՄՅՆՇՈՉՊՋՌՍՎՏՐՑՒՓՔՕՖաբգդեզէըթժիլխծկհձղ
# # ճմնշոչպջռսվտրցւփքօֆ"""
# # alph = """
# # 0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzµ
# # ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝßàáâãäåæçèéêëìíîïðñòóôõöøùúûüýÿĀāĂ
# # ăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠġĢģĤĥħĨĩĪīĬĭĮįİıĲĳĴĵĶķĸĹĺĻĽľĿŀŁłŃ
# # ńŅņŇňŉŊŋŌōŎŏŐőŒœŔŕŖŗŘřŚśŜŝŞşŠšŢţŤťŦŨũŪūŬŭŮůŰűŲųŴŵŶŷŸŹźŻżŽžƀƁƄƅƇ
# # ƈƉƊƍƎƏƐƑƒƓƔƖƗƘƙƚƛƜƝƞƟƠơƤƦƧƨƩƫƬƭƮƯưƱƲƳƴƵƶƷƸƹƻƼƽƿǍǎǏǐǑǒǓǔǕǖǗǘǙǚǛǜ
# # ǝǞǟǠǡǢǣǦǧǨǩǪǫǬǭǮǯǰǴǵǶǸǹǺǻǼǽǾǿȀȁȂȃȄȅȆȇȈȉȊȋȌȍȎȏȐȑȒȓȔȕȖȗȘșȚțȜȝȞȟȠȡ
# # ȤȥȦȧȨȩȪȫȬȭȮȯȰȱȲȳȴȵȷȺȻȼȽȾȿɀɁɃɄɅɆɌɍɐɑɓɖɗɘəɚɛɜɝɠɡɢɣɤɥɦɧɨɩɪɫɬɭɯɰɱɲɳ
# # ɴɵɶɸɹɺɻɼɽʀʁʂʊʋʌʍʎʏʐʑʒʓʔʕʖʗʘʙʛʜʝʞʟʠʮʯͶͷͼͽͿΆΈΉΊΌΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞ
# # ΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώϐϑϒϓϔϕϖϗϘϙϚϛϜϝϞϟ
# # ϠϡϤϦϰϱϲϳϴϵϷϸϹϺϻϼϽϾϿЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЬ
# # ЭЯабвгдежзийклмнопрстуфхцчшщэяѐёђѓєѕіїјћќѝўџѲѳҐґҒғҔҕҖҗҘҙҚқҢңҤҥҪ
# # ҫҬҭҮүҰұҲҳҺһӀӁӂӃӄӇӈӋӌӏӐӑӒӓӔӕӖӗӘәӚӛӜӝӞӟӠӡӢӣӤӥӦӧӨөӪӫӬӭӮӯӰӱӲӳӴӵԀԐԑԚ
# # ԛԜԝԱԲԳԴԵԶԷԸԹԺԻԼԽԾԿՀՁՂՃՄՅՆՇՈՉՊՋՌՍՎՏՐՑՒՓՔՕՖաբգդեզէըթժիլխծկհձղճ
# # մնշոչպջռսվտրցւփքօֆ"""
# # print(alph)
# #
# alph = alphabet.replace("\n", "")
# print(len(alph))
# print(log(4294967291 ** 6, len(alph)), log(18446744073709551557 ** 6, len(alph)))
#
# # REMINDER: after char 64261 not double-click friendly anymore! After 2047 = 3 bytes!
# #           Only 2286 could be selected, which gives 18 and 35 digits
# #           With 2 bytes (2047 limit) 1061 selected => 20 and 39 digits
# """
# 0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ_abcdefghijklmnopqrstuvwxyzªµºÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõöøùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠġĢģĤĥĦħĨĩĪīĬĭĮįİıĲĳĴĵĶķĸĹĺĻļĽľĿŀŁłŃńŅņŇňŉŊŋŌōŎŏŐőŒœŔŕŖŗŘřŚśŜŝŞşŠšŢţŤťŦŧŨũŪūŬŭŮůŰűŲųŴŵŶŷŸŹźŻżŽžſƀƁƂƃƄƅƆƇƈƉƊƋƌƍƎƏƐƑƒƓƔƕƖƗƘƙƚƛƜƝƞƟƠơƢƣƤƥƦƧƨƩƪƫƬƭƮƯưƱƲƳƴƵƶƷƸƹƺƻƼƽƾƿǀǁǂǃǄǅǆǇǈǉǊǋǌǍǎǏǐǑǒǓǔǕǖǗǘǙǚǛǜǝǞǟǠǡǢǣǤǥǦǧǨǩǪǫǬǭǮǯǰǱǲǳǴǵǶǷǸǹǺǻǼǽǾǿȀȁȂȃȄȅȆȇȈȉȊȋȌȍȎȏȐȑȒȓȔȕȖȗȘșȚțȜȝȞȟȠȡȤȥȦȧȨȩȪȫȬȭȮȯȰȱȲȳȴȵȶȷȸȹȺȻȼȽȾȿɀɁɃɄɅɆɌɍɐɑɒɓɔɕɖɗɘəɚɛɜɝɞɟɠɡɢɣɤɥɦɧɨɩɪɫɬɭɮɯɰɱɲɳɴɵɶɷɸɹɺɻɼɽɾɿʀʁʂʃʄʅʆʇʈʉʊʋʌʍʎʏʐʑʒʓʔʕʖʗʘʙʚʛʜʝʞʟʠʡʢʣʤʥʦʧʨʩʪʫʬʭʮʯʰʱʲʳʴʵʶʷʸʹʺʻʼʽʾʿˀˁˆˇˈˉˌˍˎˏːˑˠˡˢˣˤˬˮʹͶͷͺͻͼͽͿΆΈΉΊΌΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώϐϑϒϓϔϕϖϗϘϙϚϛϜϝϞϟϠϡϤϦϫϰϱϲϳϴϵϷϸϹϺϻϼϽϾϿЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъыьэюяѐёђѓєѕіїјљњћќѝўџѠѡѢѣѤѥѦѧѨѩѪѫѬѭѮѯѰѱѲѳѴѵѶѷѸѹѺѻѼѽѾѿҀҊҋҌҍҎҏҐґҒғҔҕҖҗҘҙҚқҜҝҞҟҠҡҢңҤҥҦҧҨҩҪҫҬҭҮүҰұҲҳҴҵҶҷҸҹҺһҼҽҾҿӀӁӂӃӄӅӆӇӈӉӊӋӌӍӎӏӐӑӒӓӔӕӖӗӘәӚӛӜӝӞӟӠӡӢӣӤӥӦӧӨөӪӫӬӭӮӯӰӱӲӳӴӵӶӷӸӹӺӻӼӽӾӿԀԐԑԒԓԚԛԜԝԞԟԤԥԦԧԩԬԮԱԲԳԴԵԶԷԸԹԺԻԼԽԾԿՀՁՂՃՄՅՆՇՈՉՊՋՌՍՎՏՐՑՒՓՔՕՖՙաբգդեզէըթժիլխծկհձղճմյնշոչպջռսվտրցւփքօֆև٠١٢٣٤٥٦٧٨٩۰۱۲۳۴۵۶۷۸۹
# """
# alph20_39 = """
# 0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ_abcdefghijklmnopqrstuvwxyzµÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö
# øùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠġĢģĤĥĦħĨĩĪīĬĭĮįİıĲĳĴĵĶķĸĹĺĻļĽľĿŀŁłŃńŅņŇňŉŊŋŌōŎŏŐőŒœŔŕŖŗŘřŚśŜŝŞşŠšŢţŤťŦŧŨũŪūŬŭŮů
# ŰűŲųŴŵŶŷŸŹźŻżŽžſƀƁƂƃƄƅƆƇƈƉƊƋƌƍƎƏƐƑƒƓƔƕƖƗƘƙƚƛƜƝƞƟƠơƢƣƤƥƦƧƨƩƪƫƬƭƮƯưƱƲƳƴƵƶƷƸƹƺƻƼƽƾƿǀǁǂǃǍǎǏǐǑǒǓǔǕǖǗǘǙǚǛǜǝǞǟǠǡǢǣǦǧ
# ǨǩǪǫǬǭǮǯǰǴǵǶǸǹǼǽǾǿȀȁȂȃȄȅȆȇȈȉȊȋȌȍȎȏȐȑȒȓȔȕȖȗȘșȚțȜȝȞȟȠȡȤȥȦȧȨȩȪȫȬȭȮȯȰȱȲȳȴȵȶȷȸȹȺȻȼȽȾȿɀɁɃɄɅɆɌɍɐɑɒɓɔɕɖɗɘəɚɛɜɝɞɟɠɡɢɣɤɥɦɧɨɩ
# ɪɫɬɭɮɯɰɱɲɳɴɵɶɷɸɹɺɻɼɽɾɿʀʁʂʃʄʅʆʇʈʉʊʋʌʍʎʏʐʑʒʓʔʕʖʗʘʙʚʛʜʝʞʟʠʡʢʣʤʥʦʧʨʩʪʫʬʭʮʯʹͶͷͺͻͼͽͿΆΈΉΊΌΎΏΐΑ
# ΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώϐϑϒϓϔϕϖϗϘϙϚϛϜϝϞϟϠϡϤϦϫϰϱϲϳϴϵϷϸϹϺϻϼϽϾϿЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗ
# ИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъыьэюяѐёђѓєѕіїјљњћќѝўџѢѣѲѳ
# ҐґҒғҔҕҖҗҘ
# ҙҚқҢңҤҥҪҫҬҭҮүҰұҲҳҺһӀӁӂӃӄӇӈӋӌӏӐӑӒӓӔӕӖӗӘәӚӛӜӝӞӟӠӡӢӣӤӥӦӧӨөӪӫӬӭӮӯӰӱӲӳӴӵӶӷӸӹ
# ԀԐԑԚԛԜԝԩԬԮԱԲԳԴԵ
# ԶԷԸԹԺԻԼԽԾԿՀՁՂՃՄՅՆՇՈՉՊՋՌՍՎՏՐՑՒՓՔՕՖաբգդեզէըթժիլխծկհձղճմյնշոչպջռսվտրցւփքօֆև
# """
# alph20_40 = """0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzµÀÁÂÃÄÅÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞßàáâãäåçèéêëìíîïðñòóôõöøùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğĠġĢģĤĥĦħĨĩĪīĬĭĮįİıĴĵĶķĸĹĺĻĽĿŁłŃńŅņŇňŉŊŋŌōŎŏŐőŔŕŖŗŘřŚśŜŝŞşŠšŢţŤťŦŧŨũŪūŬŭŮůŰűŲųŴŵŶŷŸŹźŻżŽžſƀƁƂƃƄƅƆƇƈƉƊƋƌƍƎƏƐƑƓƕƖƗƘƙƚƛƜƝƞƟƠơƢƣƤƥƦƧƨƩƪƫƬƭƮƯưƱƲƳƴƵƶƹƺƻƼƽƾƿǍǎǏǐǑǒǓǔǕǖǗǘǙǚǛǜǝǞǟǠǡǦǧǨǩǪǫǬǭǮǯǰǴǵǸǹǾǿȀȁȂȃȄȅȆȇȈȉȊȋȌȍȎȏȐȑȒȓȔȕȖȗȘșȚțȞȟȠȤȥȦȧȨȩȪȫȬȭȮȯȰȱȲȳȽɃɄɅɆɌɍɐɑɒɓɔɕɖɗɘəɚɛɜɝɞɟɠɡɢɣɤɥɦɧɨɪɫɬɯɰɱɲɳɴɵɷɸʀʁʂʉʊʋʌʍʎʏʐʑʒʓʘʙʚʛʜʝʞʟʠͶͷͻͼͽͿΆΈΉΊΌΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώϒϓϔϕϖϘϙϜϤϫϰϱϲϳϴϵϷϸϹϺϻϼϽϾϿЀЁЂЃЄЅІЇЈЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЧШЪЬЭЯабвгдежзийклмнопрстуфхчшъьэяѐёђѓєѕіїјћќѝўџѢѣѲѳҐґҒғҖҗҘҙҪҫҮүҰұҲҳҺһӀӁӂӏӐӑӒӓӖӗӘәӚӛӜӝӞӟӠӡӢӣӤӥӦӧӨөӪӫӬӭӮӯӰӱӲӳԀԐԑԚԛԜԝԱԲԳԴԵԶԷԸԹԺԻԼԽԾԿՀՁՂՃՄՅՆՇՈՉՊՋՌՍՎՏՐՑՒՓՔՕՖաբգդեզէըթժիխծկհձղճմնոպռսվտրցւփօև"""
# print(alph20_40)
# print(len(alph20_40))
# print(log(4294967291 ** 6, len(alph20_40)), log(18446744073709551557 ** 6, len(alph20_40)))

# click-friendly:
# for i in range(255):
#     print(chr(i), end="")
# $0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ_abcdefghijklmnopqrstuvwxyz¢£¤¥ªµº
# ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõöøùúûüýþ

# click-friendly and  url-friendly:
# 0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ_abcdefghijklmnopqrstuvwxyz


# reducing alph size to be clickable and url-friendly

"""
extra 2     base 64
3826380847 xxxxxx
191.999999974072352695489671486873780
128.333333316048235130326447657915837
32.8333333290120587825816119144789655
....II.L4hecDXEXSSSyZo79XOGDs4L1 True

extra 2     base 64
16434180649130699911 xxxxxx
383.999999999999978738482885382570482
256.333333333333319158988590255046972
64.8333333333333297897471475637617552
.......XSw_K3CqRlBBgAVJhTV0s09JChQ_QBNw9Bcx9ixEXCoRLcGI0PqskTT4x True
"""

"""
jeito facil
========================
Commit...
    ...comutativo
        id permanece, mas n=b16(id)     [excedente vai pra onde? usar b17?]    
    ...não-comutativo
        id permanece, mas n=b64(id)     [id colide com acima, mas n não] [fazer offset?]
        é importante indicador visual ·×
        fromid precisaria de flag etype ou prefix ·×
        conversa direto com legacy em todos os casos, mas depende do prefix sempre que importar
        CONCLUSION: exige prefix para saber a base, inviável

jeito facil 2
========================
    LSB fixo em _ em noncomutante, i.e., dígito LSB é sempre zero [perde esse dígito do git]
    _ indica a base do id
    só aceita 31 dígitos de base62, mas pra ncomm já seria 31 de qualquer forma
    o que fazer com excedente? usar base17 (i.e. +g) pra receber a base16?
    fazer offset de forma que set-da-base64 = G\H 
"""
# for bits in [128]:  # , 256]:
#     digits = bits // 4
#     for divisor_exp in range(17):
#         divisor = 2 ** divisor_exp
#         for base in [63, 64]:
#             n = int(pow(2 ** bits / divisor, 1 / 4))
#             for i in range(n, n + 1000000):
#                 if isprime(i):
#                     p = i
#                     break
#             if True or base ** (digits - 1) + p ** 4 >= p ** 6 * divisor:
#                 print(f"base-{base}", f"divisor={divisor}", digits, "digits")
#                 print(log(p ** 6 * divisor) / log(2), "|G|")
#                 print(log(p ** 4 * divisor) / log(2), "|H|")
#                 print(log(p * divisor) / log(2), "needed digits")
#                 print(f"p = 2^{digits}/{divisor}¼ - {-1 * (n - p)} = {p}")
#                 print(log(base ** (digits - 1) + p ** 4) / log(2))
#                 print()
#     print("-----------------------------------------")

with precision(200):
    b = BigFloat(128)
    divisor = BigFloat(1)
    n = int(pow(2 ** b // divisor, 1 / 4))
    for i in range(n, n + 1000):
        if isprime(i):
            p = BigFloat(i)
            break
    print(p)
    print()
    print(log(p) / log(2))
    print(log(p ** 4) / log(2))
    print(2 ** b / (p ** 4 * divisor))
    print(log(p ** 4 * divisor) / log(16))
    print(log(p ** 4 * divisor - 2 ** b) / log(16))
    print()
    # print(log(p ** 6 * divisor) / log(2))
    # print(2 ** (b * 3 // 2) / (p ** 6 * divisor))
    # print(log(p ** 6 * divisor) / log(62), "digits, get", 31)
    # print(log(p ** 6 * divisor - 62 ** 31) / log(74), "digits, get", 31)  # divisor=1 p=4294967311
    # print()
    # print(log(p ** 6 * divisor) / log(2))
    # print(2 ** (b * 3 // 2) / (p ** 6 * divisor))
    # print(log(p ** 6 * divisor) / log(62), "digits, get", 31)
    # print(log(p ** 6 * divisor - 62 ** 31) / log(63), "digits, get", 31, p)  # divisor=4201 p=533484373
    # print()
    # print(log(p ** 6 * divisor) / log(2))
    # print(2 ** (b * 3 // 2) / (p ** 6 * divisor))
    # print(log(p ** 6 * divisor) / log(62), "digits, get", 31)
    # print(log(p ** 6 * divisor - 62 ** 31) / log(65), "digits, get", 31, p)  # divisor=1034 p=757407727
    print()
    print(log(p ** 6 * divisor) / log(2))
    print(2 ** (b * 3 // 2) / (p ** 6 * divisor))
    ba = 65
    print(log(p ** 6 * divisor) / log(ba), "digits, get", 31)
    print(log(p ** 6 * divisor - ba ** 31) / log(65), "\n", "digits, get", 31, p)  # divisor=1 p=965246743

# $0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ_abcdefghijklmnopqrstuvwxyz¢£¤¥ªµº
# ÀÁÂÃÄÅ
# ÆÇ
# ÈÉÊËÌÍÎÏ
# Ð
# ÑÒÓÔÕÖ
# Ø
# ÙÚÛÜÝ
# Þß
# àáâãäå
# æ
# ç
# èéêëìíîïðñòóôõö
# ø
# ùúûüý
# þ
# print(ord("º", ))

for i in range(250):
    if len(bytes(chr(i), encoding="latin-1")) > 2:
        break
    print(chr(i), end="")

"""
!"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~¡¢£¤¥¦§¨©ª«¬®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øù

firefox:
!"'()*-.0123456789<>ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~¡¢£¤¥¦§¨©ª«¬®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øù


chrome:
!"()*-.0123456789<>ABCDEFGHIJKLMNOPQRSTUVWXYZ_abcdefghijklmnopqrstuvwxyz~¡¢£¤¥¦§¨©ª«¬®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øù
"""
